In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
#create dataFrame
dFrame = DataFrame({'key1':['A']*2 + ['B']*3, 
                    'key2':[2,2,2,3,3]})

In [3]:
dFrame

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [4]:
#fidning duplicates - will show us if rows are duplicates 
dFrame.duplicated()

0    False
1     True
2    False
3    False
4     True
dtype: bool

In [5]:
#remove the duplicates
dFrame.drop_duplicates()

  key1  key2
0    A     2
2    B     2
3    B     3

In [7]:
#which duplicates are droped from specific column
dFrame.drop_duplicates(['key1'])

  key1  key2
0    A     2
2    B     2

In [8]:
dFrame

  key1  key2
0    A     2
1    A     2
2    B     2
3    B     3
4    B     3

In [12]:
#take the last value 
#the take_last is now keep='last'

dFrame.drop_duplicates(['key1'],keep='last')

  key1  key2
1    A     2
4    B     3